findInterfaceAndCreateCyclicPatch/testCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

108
(
    block1_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       421920;
    }
    block1_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       422060;
    }
    block1_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       422200;
    }
    block1_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       422620;
    }
    block1_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       423040;
    }
    block1_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       424240;
    }
    block2_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       425440;
    }
    block2_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       425580;
    }
    block2_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       425720;
    }
    block2_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       426140;
    }
    block2_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       426560;
    }
    block2_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       427760;
    }
    block3_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       428960;
    }
    block3_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       429100;
    }
    block3_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       429240;
    }
    block3_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       429660;
    }
    block3_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       430080;
    }
    block3_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       431280;
    }
    block4_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       432480;
    }
    block4_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       432620;
    }
    block4_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       432760;
    }
    block4_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       433180;
    }
    block4_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       433600;
    }
    block4_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       434800;
    }
    block5_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       436000;
    }
    block5_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       436140;
    }
    block5_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       436280;
    }
    block5_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       436700;
    }
    block5_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       437120;
    }
    block5_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       438320;
    }
    block6_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       439520;
    }
    block6_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       439660;
    }
    block6_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       439800;
    }
    block6_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       440220;
    }
    block6_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       440640;
    }
    block6_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       441840;
    }
    block7_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       443040;
    }
    block7_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       443180;
    }
    block7_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       443320;
    }
    block7_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       443740;
    }
    block7_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       444160;
    }
    block7_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       445360;
    }
    block8_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       446560;
    }
    block8_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       446700;
    }
    block8_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       446840;
    }
    block8_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       447260;
    }
    block8_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       447680;
    }
    block8_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       448880;
    }
    block9_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       450080;
    }
    block9_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       450220;
    }
    block9_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       450360;
    }
    block9_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       450780;
    }
    block9_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       451200;
    }
    block9_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       452400;
    }
    block10_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       453600;
    }
    block10_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       453740;
    }
    block10_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       453880;
    }
    block10_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       454300;
    }
    block10_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       454720;
    }
    block10_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       455920;
    }
    block11_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       457120;
    }
    block11_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       457260;
    }
    block11_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       457400;
    }
    block11_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       457820;
    }
    block11_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       458240;
    }
    block11_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       459440;
    }
    block12_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       460640;
    }
    block12_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       460780;
    }
    block12_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       460920;
    }
    block12_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       461340;
    }
    block12_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       461760;
    }
    block12_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       462960;
    }
    block13_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       464160;
    }
    block13_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       464300;
    }
    block13_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       464440;
    }
    block13_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       464860;
    }
    block13_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       465280;
    }
    block13_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       466480;
    }
    block14_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       467680;
    }
    block14_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       467820;
    }
    block14_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       467960;
    }
    block14_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       468380;
    }
    block14_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       468800;
    }
    block14_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       470000;
    }
    block15_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       471200;
    }
    block15_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       471340;
    }
    block15_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       471480;
    }
    block15_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       471900;
    }
    block15_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       472320;
    }
    block15_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       473520;
    }
    block16_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       474720;
    }
    block16_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       474860;
    }
    block16_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       475000;
    }
    block16_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       475420;
    }
    block16_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       475840;
    }
    block16_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       477040;
    }
    block17_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       478240;
    }
    block17_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       478380;
    }
    block17_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       478520;
    }
    block17_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       478940;
    }
    block17_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       479360;
    }
    block17_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       480560;
    }
    block18_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       481760;
    }
    block18_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       481900;
    }
    block18_east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       482040;
    }
    block18_west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          420;
        startFace       482460;
    }
    block18_south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       482880;
    }
    block18_north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       484080;
    }
)

// ************************************************************************* //
